function [res1,res2,res3,res4,res5,res6,res7,res8]=test(a)
shop={[5,6],[4,5],[6,7,8],[5,6],[5,6],[5,6],[3,4],[3,4]};
pp=zeros(length(a),22);
for i=1:length(a)
    %概率
    ssum=0;
    for j=0:20
        pp(i,j+1)=poisspdf(j,a(i));
        ssum=ssum+pp(i,j+1);
    end
    pp(i,end)=1-ssum;
end

%% 求八个超时的状态转移矩阵
p155=pp(1,1);p156=1-pp(1,1);
p165=pp(1,2);p166=1-pp(1,2);
p1=[p155,p156;p165,p166];
p244=pp(2,1);p245=1-pp(2,1);
p254=pp(2,2);p255=1-pp(2,2);
p2=[p244,p245;p254,p255];
p366=pp(3,1);p367=0;p368=1-pp(3,1);
p376=pp(3,2);p377=pp(3,1);p378=1-pp(3,1)-pp(3,2);
p386=pp(3,3);p387=pp(3,2);p388=1-pp(3,2)-pp(3,3);
p3=[p366,p367,p368;p376,p377,p378;p386,p387,p388];
p455=pp(4,1);p456=1-pp(4,1);
p465=pp(4,2);p466=1-pp(4,2);
p4=[p455,p456;p465,p466];
p555=pp(5,1);p556=1-pp(5,1);
p565=pp(5,2);p566=1-pp(5,2);
p5=[p555,p556;p565,p566];
p655=pp(6,1);p656=1-pp(6,1);
p665=pp(6,2);p666=1-pp(6,2);
p6=[p655,p656;p665,p666];
p733=pp(7,1);p734=1-pp(7,1);
p743=pp(7,2);p744=1-pp(7,2);
p7=[p733,p734;p743,p744];
p833=pp(8,1);p834=1-pp(8,1);
p843=pp(8,2);p844=1-pp(8,2);
p8=[p833,p834;p843,p844];
%% 得到稳定的正则链
for i=1:10
    p1=p1*p1;
end
for i=1:10
    p2=p2*p2;
end
for i=1:10
    p3=p3*p3;
end
for i=1:10
    p4=p4*p4;
end
for i=1:10
    p5=p5*p5;
end
for i=1:10
    p6=p6*p6;
end
for i=1:10
    p7=p7*p7;
end
for i=1:10
    p8=p8*p8;
end
p1=p1(1,:);
p2=p2(1,:);
p3=p3(1,:);
p4=p4(1,:);
p5=p5(1,:);
p6=p6(1,:);
p7=p7(1,:);
p8=p8(1,:);
%% 按照全概率公式计算失去销售机会的概率
%      6     5     8     6     6     6     4     4
%      5     4     6     5     5     5     3     3
load pp.mat
pp1=[1-pp(1,1)-pp(1,2)-pp(1,3)-pp(1,4)-pp(1,5)-pp(2,6)             1-pp(1,1)-pp(1,2)-pp(1,3)-pp(1,4)-pp(1,5)-pp(1,6)-pp(1,7)];
pp2=[1-pp(2,1)-pp(2,2)-pp(2,3)-pp(2,4)-pp(2,5)                       1-pp(2,1)-pp(2,2)-pp(2,3)-pp(2,4)-pp(2,5)-pp(2,6)];
pp3=[1-pp(3,1)-pp(3,2)-pp(3,3)-pp(3,4)-pp(3,5)-pp(3,6)-pp(3,7)  1-pp(3,1)-pp(3,2)-pp(3,3)-pp(3,4)-pp(3,5)-pp(3,6)-pp(3,7)-pp(3,8)     1-pp(3,1)-pp(3,2)-pp(3,3)-pp(3,4)-pp(3,5)-pp(3,6)-pp(3,7)-pp(3,8)-pp(3,9)];
pp4=[1-pp(4,1)-pp(4,2)-pp(4,3)-pp(4,4)-pp(4,5)-pp(4,6)            1-pp(4,1)-pp(4,2)-pp(4,3)-pp(4,4)-pp(4,5)-pp(4,6)-pp(4,7)];
pp5=[1-pp(5,1)-pp(5,2)-pp(5,3)-pp(5,4)-pp(5,5)-pp(5,6)            1-pp(5,1)-pp(5,2)-pp(5,3)-pp(5,4)-pp(5,5)-pp(5,6)-pp(5,7)];
pp6=[1-pp(6,1)-pp(6,2)-pp(6,3)-pp(6,4)-pp(6,5)-pp(6,6)            1-pp(6,1)-pp(6,2)-pp(6,3)-pp(6,4)-pp(6,5)-pp(6,6)-pp(6,7)];
pp7=[1-pp(7,1)-pp(7,2)-pp(7,3)-pp(7,4)                                 1-pp(7,1)-pp(7,2)-pp(7,3)-pp(7,4)-pp(7,5)];
pp8=[1-pp(8,1)-pp(8,2)-pp(8,3)-pp(8,4)                                 1-pp(8,1)-pp(8,2)-pp(8,3)-pp(8,4)-pp(8,5)];
%% 得到结论
clear sum
res1=sum(p1.*pp1);
res2=sum(p2.*pp2);
res3=sum(p3.*pp3);
res4=sum(p4.*pp4);
res5=sum(p5.*pp5);
res6=sum(p6.*pp6);
res7=sum(p7.*pp7);
res8=sum(p8.*pp8);