%% 自动生成邻接矩阵
%初始化邻接矩阵
L=zeros(36);
%记录中含有的人员名单
name={'毕婕靖' '蔡月' '曾帅' '陈斓' '高淼' '康芸晴' '柯雅芸' '李熹俊' '梁茵' '廖颜翠' '林礼琴' '凌慧雯' '刘菁芸' '刘松荷' '柳谓' '陆盈' '骆娴' '孟芳' '潘澜巧' '潘立' '彭荃' '孙锦' '孙怡毓' '孙翼茜' '童豫' '涂蕴知' '王蕴姣' '文芝' '吴霄' '吴宇晓' '谢斑尚' '易贞' '张荆' '张培芸' '张庭琪' '钟倩'};
%导入名单
[num,txt,raw]=xlsread('2017第十届华中地区数学建模邀请赛_经典赛B题_附件_通话记录');
%循环遍历
for i=1:36
    i
    res1=strcmp(txt(:,3), name(i));
    for j=1:36
    res2=strcmp(txt(:,5), name(j));
    res=res1&res2;
    res=find(res==1);
    res=sum(num(res-1,4));
    L(i,j)=res;
    end
end
L