a=[141 148 132 138 154 142 150 146 155 158
    150 140 147 148 144 150 149 145 149 158
    143 141 144 144 126 140 144 142 141 140
    145 135 147 146 141 136 140 146 142 137
    148 154 137 139 143 140 131 143 141 149
    148 135 148 152 143 144 141 143 147 146
    150 132 142 142 143 153 149 146 149 138
    142 149 142 137 134 144 146 147 140 142
    140 137 152 145 0 0 0 0 0 0];
a=nonzeros(a);
xbar=mean(a);% 平均值
s=std(a);% 标准差
s2=var(a);% 方差
[yn,xn]=cdfcalc(a);%计算经验分布函数值
yn(end)=[];
y=normcdf(xn,xbar,s);%计算理论分布函数值
Dn=max(abs(yn-y));
LJ=1.36/sqrt(length(a));
%用工具箱进行ks检验
pd=makedist('Normal','mu',xbar,'sigma',s);
[h,p,st]=kstest(a,'CDF',pd);



