%% 用fminbnd，f(x)=(x-3)^2-1,x∈[0,5]
%求极小值
clear
clc
f=@(x) (x-3)^2-1;
[x,y]=fminbnd(f,0,5)

%% 用fseminf，f(x)=(x(1)-0.5)^2+(x(2)-0.5)^2+(x(3)-0.5)^2
%约束条件有半无穷约束
%k1(x,w(1))=sin(x(1)*w(1))*cos(x(2)*w(1))-1/1000*(w(1)-50)^2-sin(w(1)*x(3))-x(3)<=1
%k2(x,w(2))=sin(x(2)*w(2))*cos(x(1)*w(2))-1/1000*(w(2)-50)^2-sin(w(2)*x(3))-x(3)<=1
%1<=w(1)<=100,1<=w(2)<=100
%求极小值
clear
clc
f1=@(x) sum((x-0.5).^2);
x0=[0.5;0.2;0.3];
[x,fval]=fseminf(f1,x0,2,@seminfcon);
x
fval

%% 用fminimax求函数族{f1(x),f2(x),f3(x),f4(x),f5(x)}
%取极大极小值时的x的值
f=@(x) [2*x(1)^2+x(2)^2-48*x(1)-40*x(2)+304
            -x(1)^2-3*x(2)^2
            x(1)+3*x(2)-18
            -x(1)-x(2)
            x(1)+x(2)-8];
[x,y]=fminimax(f,rand(2,1))























