%% 函数说明
% mu=mean(data);求均值
% sigma=std(data);求标准差
% [V,D]=eig(A);D是特征值构成的对角阵，每个特征值对应于V矩阵中列向量（即特征向量）
% z=zscore(data);%数据标准化:新数据=(原数据-当前列的均值)/当前列的标准差
% r=cov(z);%标准化数据的协方差矩阵就是相关系数矩阵
% [x,y,z]=pcacov(r)%用协方差矩阵进行主成分分析,x是主成分，y是协方差矩阵的特征值，z是每个特征向量表征在观测量总方差中所占的百分数。
%% 主程序
data=[
    5.96 310 461 1557  931 319  44.36  2615  2.20 13631
    3.39 234 308 1035  498 161  35.02  3052  .90 12665
    2.35 157 229 713 295 109  38.40  3031  .86 9385
    1.35 81 111 364 150 58  30.45  2699  1.22 7881
    1.50 88 128 421 144 58  34.30  2808  .54 7733
    1.67 86 120 370 153 58  33.53  2215  .76 7480
    1.17 63 93 296 117 44  35.22  2528  .58 8570
    1.05 67 92 297 115 43  32.89  2835  .66 7262
    .95 64 94 287 102 39  31.54  3008  .39 7786
    .69 39 71 205 61 24  34.50  2988  .37 11355
    .56 40 57 177 61 23  32.62  3149  .55 7693
    .57 58 64 181 57 22  32.95  3202  .28 6805
    .71 42 62 190 66 26  28.13  2657  .73 7282
    .74 42 61 194 61 24  33.06  2618  .47 6477
    .86 42 71 204 66 26  29.94  2363  .25 7704
    1.29 47 73 265 114 46  25.93  2060  .37 5719
    1.04 53 71 218 63 26  29.01  2099  .29 7106
    .85 53 65 218 76 30  25.63  2555  .43 5580
    .81 43 66 188 61 23  29.82  2313  .31 5704
    .59 35 47 146 46 20  32.83  2488  .33 5628
    .66 36 40 130 44 19  28.55  1974  .48 9106
    .77 43 63 194 67 23  28.81  2515  .34 4085
    .70 33 51 165 47 18  27.34  2344  .28 7928
    .84 43 48 171 65 29  27.65  2032  .32 5581
    1.69 26 45 137 75 33  12.10  810 1.00 14199
    .55 32 46 130 44 17  28.41  2341  .30 5714
    .60 28 43 129 39 17  31.93  2146  .24 5139
    1.39 48  62 208  77 34  22.70 1500  .42 5377
    .64 23 32 93 37 16  28.12 1469  .34  5415
    1.48 38 46 151 63 30  17.87 1024  .38 7368
    ];
[m,n]=size(data);num=4; %num为选取的主成分的个数
mu=mean(data);
sigma=std(data);
snb=zscore(data); %数据标准化
b=snb(:,1:end-1); %x1,x2,x3,x4的数据赋给b
r=cov(b); %标准化数据的协方差阵就是相关系数阵
[x,y,z]=pcacov(r);
f=repmat(sign(sum(x)),size(x,1),1);
x=x.*f;
%以下是普通的最小二乘法回归
r=[ones(m,1),b]\snb(:,end); %标准化数据的回归方程系数
bzh=mu./sigma;
ch10=mu(end)-bzh(1:end-1)*r(2:end)*sigma(end); %原始数据的常数项
fr=r(2:end);fr=fr';
ch1=fr./sigma(1:end-1)*sigma(end); %原始数据的x1,x2等等系数
%以下是主成分回归
pval=b*x(:,1:num);
rp=[ones(m,1),pval]\snb(:,end); %主成分数据的回归方程系数
beta=x(:,1:num)*rp(2:num+1); %标准化数据的回归方程系数
ch20=mu(end)-bzh(1:end-1)*beta*sigma(end); %原始数据的常数项
fr=beta';
ch2=fr./sigma(1:end-1)*sigma(end); %原始数据的x1,x2等等系数
check1=sqrt(sum((data(:,1:end-1)*ch1'+ch10-data(:,end)).^2)/(m-n));
check2=sqrt(sum((data(:,1:end-1)*ch2'+ch20-data(:,end)).^2)/(m-num-1));



