clear;close;clc;
RIT=[0 0 0.52 0.89 1.12 1.26 1.36 1.41 1.46 1.49 1.52 1.54 1.56...
    1.58 1.59 1.605 1.6158 1.6264 1.6327 1.6403 1.6481 1.6531...
    1.6591 1.6622 1.6686 1.6705 1.6755 1.6779 1.6816 1.6840];
%          政治    经济    金融
% 政治    1
% 经济               1
% 金融                            1
%% 4个行业机遇
%准则层通路通航对方案层的判断矩阵
a=[1 4 5;1/4 1 1;1/5 1 1];
%准则层基础建设对方案层的判断矩阵
b=[1 4 7;1/4 1 3;1/7 1/3 1];
%准则层能源建设对方案层的判断矩阵
c=[1 5 8;1/5 1 2;1/8 1/2 1];
%准则层商贸旅游对方案层的判断矩阵
d=[1 4 7;1/4 1 3;1/7 1/3 1];
%% 4个行业风险
e=[1 1 7;1 1 9;1/7 1/9 1];
%准则层基础建设对方案层的判断矩阵
f=[1 1 3;1 1 7;1/3 1/7 1];
%准则层能源建设对方案层的判断矩阵
g=[1 1 5;1 1 9;1/5 1/9 1];
%准则层商贸旅游对方案层的判断矩阵
h=[1 1 2;1 1 5;1/2 1/5 1];
%% 处理部分
[max(1),wa]=ahp(a);
[max(2),wb]=ahp(b);
[max(3),wc]=ahp(c);
[max(4),wd]=ahp(d);
[max(5),we]=ahp(e);
[max(6),wf]=ahp(f);
[max(7),wg]=ahp(g);
[max(8),wh]=ahp(h);
[RIa,CIa]=sglsortexamine(max(1),a,RIT);
[RIb,CIb]=sglsortexamine(max(2),b,RIT);
[RIc,CIc]=sglsortexamine(max(3),c,RIT);
[RId,CId]=sglsortexamine(max(4),d,RIT);
[RIe,CIe]=sglsortexamine(max(5),e,RIT);
[RIf,CIf]=sglsortexamine(max(6),f,RIT);
[RIg,CIg]=sglsortexamine(max(7),g,RIT);
[RIh,CIh]=sglsortexamine(max(8),h,RIT);
%dw1-4列是四个行业机遇权重，5-8是风险权重,政治经济金融
dw=zeros(3,8);
dw(1:3,1)=wa;
dw(1:3,2)=wb;
dw(1:3,3)=wc;
dw(1:3,4)=wd;
dw(1:3,5)=we;
dw(1:3,6)=wf;
dw(1:3,7)=wg;
dw(1:3,8)=wh;
load A.mat
% res(1,:)是新加坡，res(2,:)是沙特,1-4机遇,5-8风险
res(:,1)=A2(2:3)*dw(3,1)+A3(2:3)*dw(2,1)+A5(2:3)*dw(1,1);
res(:,2)=A2(2:3)*dw(3,2)+A3(2:3)*dw(2,2)+A5(2:3)*dw(1,2);
res(:,3)=A2(2:3)*dw(3,3)+A3(2:3)*dw(2,3)+A5(2:3)*dw(1,3);
res(:,4)=A2(2:3)*dw(3,4)+A3(2:3)*dw(2,4)+A5(2:3)*dw(1,4);
res(:,5)=A1(2:3)*dw(3,5)+A4(2:3)*dw(2,5)+A6(2:3)*dw(1,5);
res(:,6)=A1(2:3)*dw(3,6)+A4(2:3)*dw(2,6)+A6(2:3)*dw(1,6);
res(:,7)=A1(2:3)*dw(3,7)+A4(2:3)*dw(2,7)+A6(2:3)*dw(1,7);
res(:,8)=A1(2:3)*dw(3,8)+A4(2:3)*dw(2,8)+A6(2:3)*dw(1,8);
