% 关联度分析
clc,clear
% 一个参考序列，m个比较序列，计算比较系列关于参考序列的关联系数
example_1=[
13.6  14.01  14.54  15.64  15.69;
11.50  13.00  15.15  15.30  15.02;
13.76  16.36  16.90  16.56  17.30;
12.41  12.70  13.96  14.04  13.46;
2.48  2.49  2.56  2.64  2.59;
85  85  90  100  105;
55  65  75  80  80;
65  70  75  85  90;
12.80  15.30  16.24  16.40  17.05;
15.30  18.40  18.75  17.95  19.30;
12.71  14.50  14.66  15.88  15.70;
14.78  15.54  16.03  16.87  17.82;
7.64  7.56  7.76  7.54  7.70;
120  125  130  140  140;
80  85  90  90  95;
4.2  4.25  4.1  4.06  3.99;
13.1  13.42  12.85  12.72  12.56;    
];
% 标准化数据：注意极性的不同
% 行数是样本种类数，列数是每个样本的不同的数据个数
for i = 1:15
    example_1(i, :) = example_1(i, :) / example_1(i, 1);
end
for i = 16:17
    example_1(i, :) = example_1(i, 1) ./ example_1(i, :);
end

data = example_1;
% 1表述维度，行，列，。。。
n = size(data, 1);
% 计算关联系数: ck = 参考， bj = 比较
ck = data(1, :); m1 = size(ck, 1);
bj = data(2:n, :); m2 = size(bj, 1);
for i = 1:m1
    for j = 1:m2
        t(j, :) = bj(j, :) - ck(i, :);
    end
    jc1 = min(min(abs(t'))); jc2 = max(max(abs(t')));
    rho = 0.5;
    ksi = (jc1 + rho*jc2) ./ (abs(t) + rho*jc2);
    rt = sum(ksi') / size(ksi, 2);
    r(i, :) = rt;
end
r; % 关联系数向量

% 关联度按照将序排列
[rs, rind] = sort(r, 'descend');